workWithClint/TestCaseFSI-V1.6ext/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          30;
        startFace       2186;
    }
    outlet
    {
        type            patch;
        nFaces          30;
        startFace       2216;
    }
    tailFluid
    {
        type            patch;
        nFaces          36;
        startFace       2246;
    }
    topWall
    {
        type            wall;
        nFaces          40;
        startFace       2282;
    }
    bottomWall
    {
        type            wall;
        nFaces          36;
        startFace       2322;
    }
    frontAndBack
    {
        type            empty;
        nFaces          2272;
        startFace       2358;
    }
)

// ************************************************************************* //
