workWithClint/TestCaseFSI-V1.6ext/fluid/constant/couplingProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solidPatch      tailSolid;
solidZone       tailSolidZone;
fluidPatch      tailFluid;
fluidZone       tailFluidZone;
//for both the solid and fluid the HronTurek tutorial case has zone information
//I'm not sure it's necessary here due to mesh generation
//movingRegion    region0;

fsiRelaxationFactor 0.01;

interfaceDeformationLimit 0.01;

outerCorrTolerance 1e-4;

couplingScheme Aitken;

fsi yes;
// ************************************************************************* //
