workWithClint/TestCaseFSI-V1.6ext/fluid/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    tailFluid
    {
	type		fixedValue;
	value		uniform 400;
    }
    topWall      
    {
        type            fixedValue;
	value		uniform 300;
    }

    bottomWall      
    {
        type            fixedValue;
	value		uniform 400;
    }

    inlet      
    {
        type            fixedValue;
	value		uniform 300;
    }

    outlet      
    {
        type            fixedValue;
	value		uniform 200;
    }

    frontAndBack    
    {
        type            empty;
    }
}

// ************************************************************************* //
