workWithClint/TestCaseFSI-V1.6ext/fluid/0/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           tetPointVectorField;
    location	    "0";
    object          motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    tailFluid
    {
        type 		fixedValue;    
        value 		uniform (0 0 0);
    }
    topWall
    {
//       type slip;    
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomWall
    {
//       type slip;
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type 		fixedValue;    
        value 		uniform (0 0 0);
    }
    inlet
    {
        type 		fixedValue;    
        value 		uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type 		empty;
    }
}
// ************************************************************************* //
