workWithClint/TestCaseFSI-V1.6ext/fluid/system/tetFemSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          tetFemSolution;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//    motionU         ICCG 1e-06 0;
    motionU         BICCG 1e-06 0 100;

//HronTurek Tutorial has the following here:
/*motionU*/
/*{*/
/*    solver          PCG;*/
/*    preconditioner  DIC;*/
/*    tolerance       1e-07;*/
/*    relTol          0.001;*/
/*}*/
}

// ************************************************************************* //
